MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18323/mcu.h
extern volatile EEADRLbits_t EEADRLbits __at(0x891);
// bitfield macros
#define _EEADRL_NVMADR0_POSN                                0x0
#define _EEADRL_NVMADR0_POSITION                            0x0
#define _EEADRL_NVMADR0_SIZE                                0x1
#define _EEADRL_NVMADR0_LENGTH                              0x1
#define _EEADRL_NVMADR0_MASK                                0x1
#define _EEADRL_NVMADR1_POSN                                0x1
#define _EEADRL_NVMADR1_POSITION                            0x1
#define _EEADRL_NVMADR1_SIZE                                0x1
#define _EEADRL_NVMADR1_LENGTH                              0x1
#define _EEADRL_NVMADR1_MASK                                0x2
#define _EEADRL_NVMADR2_POSN                                0x2
#define _EEADRL_NVMADR2_POSITION                            0x2
#define _EEADRL_NVMADR2_SIZE                                0x1
#define _EEADRL_NVMADR2_LENGTH                              0x1
#define _EEADRL_NVMADR2_MASK                                0x4
#define _EEADRL_NVMADR3_POSN                                0x3
#define _EEADRL_NVMADR3_POSITION                            0x3
#define _EEADRL_NVMADR3_SIZE                                0x1
#define _EEADRL_NVMADR3_LENGTH                              0x1
#define _EEADRL_NVMADR3_MASK                                0x8
#define _EEADRL_NVMADR4_POSN                                0x4
#define _EEADRL_NVMADR4_POSITION                            0x4
#define _EEADRL_NVMADR4_SIZE                                0x1
#define _EEADRL_NVMADR4_LENGTH                              0x1
#define _EEADRL_NVMADR4_MASK                                0x10
#define _EEADRL_NVMADR5_POSN                                0x5
#define _EEADRL_NVMADR5_POSITION                            0x5
#define _EEADRL_NVMADR5_SIZE                                0x1
#define _EEADRL_NVMADR5_LENGTH                              0x1
#define _EEADRL_NVMADR5_MASK                                0x20
#define _EEADRL_NVMADR6_POSN                                0x6
#define _EEADRL_NVMADR6_POSITION                            0x6
#define _EEADRL_NVMADR6_SIZE                                0x1
#define _EEADRL_NVMADR6_LENGTH                              0x1
#define _EEADRL_NVMADR6_MASK                                0x40
#define _EEADRL_NVMADR7_POSN                                0x7
#define _EEADRL_NVMADR7_POSITION                            0x7
#define _EEADRL_NVMADR7_SIZE                                0x1
#define _EEADRL_NVMADR7_LENGTH                              0x1
#define _EEADRL_NVMADR7_MASK                                0x80
#define _EEADRL_NVMADRL_POSN                                0x0
#define _EEADRL_NVMADRL_POSITION                            0x0
#define _EEADRL_NVMADRL_SIZE                                0x8
#define _EEADRL_NVMADRL_LENGTH                              0x8
#define _EEADRL_NVMADRL_MASK                                0xFF
#define _EEADRL_EEADR0_POSN                                 0x0
#define _EEADRL_EEADR0_POSITION                             0x0
#define _EEADRL_EEADR0_SIZE                                 0x1
#define _EEADRL_EEADR0_LENGTH                               0x1
#define _EEADRL_EEADR0_MASK                                 0x1
#define _EEADRL_EEADR1_POSN                                 0x1
#define _EEADRL_EEADR1_POSITION                             0x1
#define _EEADRL_EEADR1_SIZE                                 0x1
#define _EEADRL_EEADR1_LENGTH                               0x1
#define _EEADRL_EEADR1_MASK                                 0x2
#define _EEADRL_EEADR2_POSN                                 0x2
#define _EEADRL_EEADR2_POSITION                             0x2
#define _EEADRL_EEADR2_SIZE                                 0x1
#define _EEADRL_EEADR2_LENGTH                               0x1
#define _EEADRL_EEADR2_MASK                                 0x4
#define _EEADRL_EEADR3_POSN                                 0x3
#define _EEADRL_EEADR3_POSITION                             0x3
#define _EEADRL_EEADR3_SIZE                                 0x1
#define _EEADRL_EEADR3_LENGTH                               0x1
#define _EEADRL_EEADR3_MASK                                 0x8
#define _EEADRL_EEADR4_POSN                                 0x4
#define _EEADRL_EEADR4_POSITION                             0x4
#define _EEADRL_EEADR4_SIZE                                 0x1
#define _EEADRL_EEADR4_LENGTH                               0x1
#define _EEADRL_EEADR4_MASK                                 0x10
#define _EEADRL_EEADR5_POSN                                 0x5
#define _EEADRL_EEADR5_POSITION                             0x5
#define _EEADRL_EEADR5_SIZE                                 0x1
#define _EEADRL_EEADR5_LENGTH                               0x1
#define _EEADRL_EEADR5_MASK                                 0x20
#define _EEADRL_EEADR6_POSN                                 0x6
#define _EEADRL_EEADR6_POSITION                             0x6
#define _EEADRL_EEADR6_SIZE                                 0x1
#define _EEADRL_EEADR6_LENGTH                               0x1
#define _EEADRL_EEADR6_MASK                                 0x40
#define _EEADRL_EEADR7_POSN                                 0x7
#define _EEADRL_EEADR7_POSITION                             0x7
#define _EEADRL_EEADR7_SIZE                                 0x1
#define _EEADRL_EEADR7_LENGTH                               0x1
#define _EEADRL_EEADR7_MASK                                 0x80
#define _EEADRL_EEADRL_POSN                                 0x0
#define _EEADRL_EEADRL_POSITION                             0x0
#define _EEADRL_EEADRL_SIZE                                 0x8
#define _EEADRL_EEADRL_LENGTH                               0x8
#define _EEADRL_EEADRL_MASK                                 0xFF
#define _EEADRL_PMADRL_POSN                                 0x0
#define _EEADRL_PMADRL_POSITION                             0x0
#define _EEADRL_PMADRL_SIZE                                 0x8
#define _EEADRL_PMADRL_LENGTH                               0x8
#define _EEADRL_PMADRL_MASK                                 0xFF
typedef union {
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
    struct {
        unsigned NVMADRL                :8;
    };
    struct {
        unsigned EEADR0                 :1;
        unsigned EEADR1                 :1;
        unsigned EEADR2                 :1;
        unsigned EEADR3                 :1;
        unsigned EEADR4                 :1;
        unsigned EEADR5                 :1;
        unsigned EEADR6                 :1;
        unsigned EEADR7                 :1;
    };
    struct {
        unsigned EEADRL                 :8;
    };
    struct {
        unsigned PMADRL                 :8;
    };
} PMADRLbits_t;
extern volatile PMADRLbits_t PMADRLbits __at(0x891);
// bitfield macros
#define _PMADRL_NVMADR0_POSN                                0x0
#define _PMADRL_NVMADR0_POSITION                            0x0
#define _PMADRL_NVMADR0_SIZE                                0x1
#define _PMADRL_NVMADR0_LENGTH                              0x1
#define _PMADRL_NVMADR0_MASK                                0x1
#define _PMADRL_NVMADR1_POSN                                0x1
#define _PMADRL_NVMADR1_POSITION                            0x1
#define _PMADRL_NVMADR1_SIZE                                0x1
#define _PMADRL_NVMADR1_LENGTH                              0x1
#define _PMADRL_NVMADR1_MASK                                0x2
#define _PMADRL_NVMADR2_POSN                                0x2
#define _PMADRL_NVMADR2_POSITION                            0x2
#define _PMADRL_NVMADR2_SIZE                                0x1
#define _PMADRL_NVMADR2_LENGTH                              0x1
#define _PMADRL_NVMADR2_MASK                                0x4
#define _PMADRL_NVMADR3_POSN                                0x3
#define _PMADRL_NVMADR3_POSITION                            0x3
#define _PMADRL_NVMADR3_SIZE                                0x1
#define _PMADRL_NVMADR3_LENGTH                              0x1
#define _PMADRL_NVMADR3_MASK                                0x8
#define _PMADRL_NVMADR4_POSN                                0x4
#define _PMADRL_NVMADR4_POSITION                            0x4
#define _PMADRL_NVMADR4_SIZE                                0x1
#define _PMADRL_NVMADR4_LENGTH                              0x1
#define _PMADRL_NVMADR4_MASK                                0x10
#define _PMADRL_NVMADR5_POSN                                0x5
#define _PMADRL_NVMADR5_POSITION                            0x5
#define _PMADRL_NVMADR5_SIZE                                0x1
#define _PMADRL_NVMADR5_LENGTH                              0x1
#define _PMADRL_NVMADR5_MASK                                0x20
#define _PMADRL_NVMADR6_POSN                                0x6
#define _PMADRL_NVMADR6_POSITION                            0x6
#define _PMADRL_NVMADR6_SIZE                                0x1
#define _PMADRL_NVMADR6_LENGTH                              0x1
#define _PMADRL_NVMADR6_MASK                                0x40
#define _PMADRL_NVMADR7_POSN                                0x7
#define _PMADRL_NVMADR7_POSITION                            0x7
#define _PMADRL_NVMADR7_SIZE                                0x1
#define _PMADRL_NVMADR7_LENGTH                              0x1
#define _PMADRL_NVMADR7_MASK                                0x80
#define _PMADRL_NVMADRL_POSN                                0x0
#define _PMADRL_NVMADRL_POSITION                            0x0
#define _PMADRL_NVMADRL_SIZE                                0x8
#define _PMADRL_NVMADRL_LENGTH                              0x8
#define _PMADRL_NVMADRL_MASK                                0xFF
#define _PMADRL_EEADR0_POSN                                 0x0
#define _PMADRL_EEADR0_POSITION                             0x0
#define _PMADRL_EEADR0_SIZE                                 0x1
#define _PMADRL_EEADR0_LENGTH                               0x1
#define _PMADRL_EEADR0_MASK                                 0x1
#define _PMADRL_EEADR1_POSN                                 0x1
#define _PMADRL_EEADR1_POSITION                             0x1
#define _PMADRL_EEADR1_SIZE                                 0x1
#define _PMADRL_EEADR1_LENGTH                               0x1
#define _PMADRL_EEADR1_MASK                                 0x2
#define _PMADRL_EEADR2_POSN                                 0x2
#define _PMADRL_EEADR2_POSITION                             0x2
#define _PMADRL_EEADR2_SIZE                                 0x1
#define _PMADRL_EEADR2_LENGTH                               0x1
#define _PMADRL_EEADR2_MASK                                 0x4
#define _PMADRL_EEADR3_POSN                                 0x3
#define _PMADRL_EEADR3_POSITION                             0x3
#define _PMADRL_EEADR3_SIZE                                 0x1
#define _PMADRL_EEADR3_LENGTH                               0x1
#define _PMADRL_EEADR3_MASK                                 0x8
#define _PMADRL_EEADR4_POSN                                 0x4
#define _PMADRL_EEADR4_POSITION                             0x4
#define _PMADRL_EEADR4_SIZE                                 0x1
#define _PMADRL_EEADR4_LENGTH                               0x1
#define _PMADRL_EEADR4_MASK                                 0x10
#define _PMADRL_EEADR5_POSN                                 0x5
#define _PMADRL_EEADR5_POSITION                             0x5
#define _PMADRL_EEADR5_SIZE                                 0x1
#define _PMADRL_EEADR5_LENGTH                               0x1
#define _PMADRL_EEADR5_MASK                                 0x20
#define _PMADRL_EEADR6_POSN                                 0x6
#define _PMADRL_EEADR6_POSITION                             0x6
#define _PMADRL_EEADR6_SIZE                                 0x1
#define _PMADRL_EEADR6_LENGTH                               0x1
#define _PMADRL_EEADR6_MASK                                 0x40
#define _PMADRL_EEADR7_POSN                                 0x7
#define _PMADRL_EEADR7_POSITION                             0x7
#define _PMADRL_EEADR7_SIZE                                 0x1
#define _PMADRL_EEADR7_LENGTH                               0x1
#define _PMADRL_EEADR7_MASK                                 0x80
#define _PMADRL_EEADRL_POSN                                 0x0
#define _PMADRL_EEADRL_POSITION                             0x0
#define _PMADRL_EEADRL_SIZE                                 0x8
#define _PMADRL_EEADRL_LENGTH                               0x8
#define _PMADRL_EEADRL_MASK                                 0xFF
#define _PMADRL_PMADRL_POSN                                 0x0
#define _PMADRL_PMADRL_POSITION                             0x0
#define _PMADRL_PMADRL_SIZE                                 0x8
#define _PMADRL_PMADRL_LENGTH                               0x8
#define _PMADRL_PMADRL_MASK                                 0xFF

