MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18323/mcu.h
// Register: NVMADRH
#define NVMADRH NVMADRH
extern volatile unsigned char           NVMADRH             __at(0x892);
#ifndef _LIB_BUILD
asm("NVMADRH equ 0892h");
#endif
// aliases
extern volatile unsigned char           EEADRH              __at(0x892);
#ifndef _LIB_BUILD
asm("EEADRH equ 0892h");
#endif
extern volatile unsigned char           PMADRH              __at(0x892);
#ifndef _LIB_BUILD
asm("PMADRH equ 0892h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRH                :7;
    };
    struct {
        unsigned NVMADR8                :1;
        unsigned NVMADR9                :1;
        unsigned NVMADR10               :1;
        unsigned NVMADR11               :1;
        unsigned NVMADR12               :1;
        unsigned NVMADR13               :1;
        unsigned NVMADR14               :1;
    };
    struct {
        unsigned EEADR8                 :1;
        unsigned EEADR9                 :1;
        unsigned EEADR10                :1;
        unsigned EEADR11                :1;
        unsigned EEADR12                :1;
        unsigned EEADR13                :1;
        unsigned EEADR14                :1;
    };
    struct {
        unsigned EEADRH                 :7;
    };
    struct {
        unsigned PMADRH                 :7;
    };
} NVMADRHbits_t;
extern volatile NVMADRHbits_t NVMADRHbits __at(0x892);
// bitfield macros
#define _NVMADRH_NVMADRH_POSN                               0x0
#define _NVMADRH_NVMADRH_POSITION                           0x0
#define _NVMADRH_NVMADRH_SIZE                               0x7
#define _NVMADRH_NVMADRH_LENGTH                             0x7
#define _NVMADRH_NVMADRH_MASK                               0x7F
#define _NVMADRH_NVMADR8_POSN                               0x0
#define _NVMADRH_NVMADR8_POSITION                           0x0
#define _NVMADRH_NVMADR8_SIZE                               0x1
#define _NVMADRH_NVMADR8_LENGTH                             0x1
#define _NVMADRH_NVMADR8_MASK                               0x1
#define _NVMADRH_NVMADR9_POSN                               0x1
#define _NVMADRH_NVMADR9_POSITION                           0x1
#define _NVMADRH_NVMADR9_SIZE                               0x1
#define _NVMADRH_NVMADR9_LENGTH                             0x1
#define _NVMADRH_NVMADR9_MASK                               0x2
#define _NVMADRH_NVMADR10_POSN                              0x2
#define _NVMADRH_NVMADR10_POSITION                          0x2
#define _NVMADRH_NVMADR10_SIZE                              0x1
#define _NVMADRH_NVMADR10_LENGTH                            0x1
#define _NVMADRH_NVMADR10_MASK                              0x4
#define _NVMADRH_NVMADR11_POSN                              0x3
#define _NVMADRH_NVMADR11_POSITION                          0x3
#define _NVMADRH_NVMADR11_SIZE                              0x1
#define _NVMADRH_NVMADR11_LENGTH                            0x1
#define _NVMADRH_NVMADR11_MASK                              0x8
#define _NVMADRH_NVMADR12_POSN                              0x4
#define _NVMADRH_NVMADR12_POSITION                          0x4
#define _NVMADRH_NVMADR12_SIZE                              0x1
#define _NVMADRH_NVMADR12_LENGTH                            0x1
#define _NVMADRH_NVMADR12_MASK                              0x10
#define _NVMADRH_NVMADR13_POSN                              0x5
#define _NVMADRH_NVMADR13_POSITION                          0x5
#define _NVMADRH_NVMADR13_SIZE                              0x1
#define _NVMADRH_NVMADR13_LENGTH                            0x1
#define _NVMADRH_NVMADR13_MASK                              0x20
#define _NVMADRH_NVMADR14_POSN                              0x6
#define _NVMADRH_NVMADR14_POSITION                          0x6
#define _NVMADRH_NVMADR14_SIZE                              0x1
#define _NVMADRH_NVMADR14_LENGTH                            0x1
#define _NVMADRH_NVMADR14_MASK                              0x40
#define _NVMADRH_EEADR8_POSN                                0x0
#define _NVMADRH_EEADR8_POSITION                            0x0
#define _NVMADRH_EEADR8_SIZE                                0x1
#define _NVMADRH_EEADR8_LENGTH                              0x1
#define _NVMADRH_EEADR8_MASK                                0x1
#define _NVMADRH_EEADR9_POSN                                0x1
#define _NVMADRH_EEADR9_POSITION                            0x1
#define _NVMADRH_EEADR9_SIZE                                0x1
#define _NVMADRH_EEADR9_LENGTH                              0x1
#define _NVMADRH_EEADR9_MASK                                0x2
#define _NVMADRH_EEADR10_POSN                               0x2
#define _NVMADRH_EEADR10_POSITION                           0x2
#define _NVMADRH_EEADR10_SIZE                               0x1
#define _NVMADRH_EEADR10_LENGTH                             0x1
#define _NVMADRH_EEADR10_MASK                               0x4
#define _NVMADRH_EEADR11_POSN                               0x3
#define _NVMADRH_EEADR11_POSITION                           0x3
#define _NVMADRH_EEADR11_SIZE                               0x1
#define _NVMADRH_EEADR11_LENGTH                             0x1
#define _NVMADRH_EEADR11_MASK                               0x8
#define _NVMADRH_EEADR12_POSN                               0x4
#define _NVMADRH_EEADR12_POSITION                           0x4
#define _NVMADRH_EEADR12_SIZE                               0x1
#define _NVMADRH_EEADR12_LENGTH                             0x1
#define _NVMADRH_EEADR12_MASK                               0x10
#define _NVMADRH_EEADR13_POSN                               0x5
#define _NVMADRH_EEADR13_POSITION                           0x5
#define _NVMADRH_EEADR13_SIZE                               0x1
#define _NVMADRH_EEADR13_LENGTH                             0x1
#define _NVMADRH_EEADR13_MASK                               0x20
#define _NVMADRH_EEADR14_POSN                               0x6
#define _NVMADRH_EEADR14_POSITION                           0x6
#define _NVMADRH_EEADR14_SIZE                               0x1
#define _NVMADRH_EEADR14_LENGTH                             0x1
#define _NVMADRH_EEADR14_MASK                               0x40
#define _NVMADRH_EEADRH_POSN                                0x0
#define _NVMADRH_EEADRH_POSITION                            0x0
#define _NVMADRH_EEADRH_SIZE                                0x7
#define _NVMADRH_EEADRH_LENGTH                              0x7
#define _NVMADRH_EEADRH_MASK                                0x7F
#define _NVMADRH_PMADRH_POSN                                0x0
#define _NVMADRH_PMADRH_POSITION                            0x0
#define _NVMADRH_PMADRH_SIZE                                0x7
#define _NVMADRH_PMADRH_LENGTH                              0x7
#define _NVMADRH_PMADRH_MASK                                0x7F
// alias bitfield definitions
typedef union {
    struct {
        unsigned NVMADRH                :7;
    };
    struct {
        unsigned NVMADR8                :1;
        unsigned NVMADR9                :1;
        unsigned NVMADR10               :1;
        unsigned NVMADR11               :1;
        unsigned NVMADR12               :1;
        unsigned NVMADR13               :1;
        unsigned NVMADR14               :1;
    };
    struct {
        unsigned EEADR8                 :1;
        unsigned EEADR9                 :1;
        unsigned EEADR10                :1;
        unsigned EEADR11                :1;
        unsigned EEADR12                :1;
        unsigned EEADR13                :1;
        unsigned EEADR14                :1;
    };
    struct {
        unsigned EEADRH                 :7;
    };
    struct {
        unsigned PMADRH                 :7;
    };
} EEADRHbits_t;
extern volatile EEADRHbits_t EEADRHbits __at(0x892);
// bitfield macros
#define _EEADRH_NVMADRH_POSN                                0x0
#define _EEADRH_NVMADRH_POSITION                            0x0
#define _EEADRH_NVMADRH_SIZE                                0x7
#define _EEADRH_NVMADRH_LENGTH                              0x7
#define _EEADRH_NVMADRH_MASK                                0x7F
#define _EEADRH_NVMADR8_POSN                                0x0
#define _EEADRH_NVMADR8_POSITION                            0x0
#define _EEADRH_NVMADR8_SIZE                                0x1
#define _EEADRH_NVMADR8_LENGTH                              0x1
#define _EEADRH_NVMADR8_MASK                                0x1
#define _EEADRH_NVMADR9_POSN                                0x1
#define _EEADRH_NVMADR9_POSITION                            0x1
#define _EEADRH_NVMADR9_SIZE                                0x1
#define _EEADRH_NVMADR9_LENGTH                              0x1
#define _EEADRH_NVMADR9_MASK                                0x2
#define _EEADRH_NVMADR10_POSN                               0x2
#define _EEADRH_NVMADR10_POSITION                           0x2
#define _EEADRH_NVMADR10_SIZE                               0x1
#define _EEADRH_NVMADR10_LENGTH                             0x1
#define _EEADRH_NVMADR10_MASK                               0x4
#define _EEADRH_NVMADR11_POSN                               0x3
#define _EEADRH_NVMADR11_POSITION                           0x3
#define _EEADRH_NVMADR11_SIZE                               0x1
#define _EEADRH_NVMADR11_LENGTH                             0x1
#define _EEADRH_NVMADR11_MASK                               0x8
#define _EEADRH_NVMADR12_POSN                               0x4
#define _EEADRH_NVMADR12_POSITION                           0x4
#define _EEADRH_NVMADR12_SIZE                               0x1
#define _EEADRH_NVMADR12_LENGTH                             0x1
#define _EEADRH_NVMADR12_MASK                               0x10
#define _EEADRH_NVMADR13_POSN                               0x5
#define _EEADRH_NVMADR13_POSITION                           0x5
#define _EEADRH_NVMADR13_SIZE                               0x1
#define _EEADRH_NVMADR13_LENGTH                             0x1
#define _EEADRH_NVMADR13_MASK                               0x20
#define _EEADRH_NVMADR14_POSN                               0x6
#define _EEADRH_NVMADR14_POSITION                           0x6
#define _EEADRH_NVMADR14_SIZE                               0x1
#define _EEADRH_NVMADR14_LENGTH                             0x1
#define _EEADRH_NVMADR14_MASK                               0x40
#define _EEADRH_EEADR8_POSN                                 0x0
#define _EEADRH_EEADR8_POSITION                             0x0
#define _EEADRH_EEADR8_SIZE                                 0x1
#define _EEADRH_EEADR8_LENGTH                               0x1
#define _EEADRH_EEADR8_MASK                                 0x1
#define _EEADRH_EEADR9_POSN                                 0x1
#define _EEADRH_EEADR9_POSITION                             0x1
#define _EEADRH_EEADR9_SIZE                                 0x1
#define _EEADRH_EEADR9_LENGTH                               0x1
#define _EEADRH_EEADR9_MASK                                 0x2
#define _EEADRH_EEADR10_POSN                                0x2
#define _EEADRH_EEADR10_POSITION                            0x2
#define _EEADRH_EEADR10_SIZE                                0x1
#define _EEADRH_EEADR10_LENGTH                              0x1
#define _EEADRH_EEADR10_MASK                                0x4
#define _EEADRH_EEADR11_POSN                                0x3
#define _EEADRH_EEADR11_POSITION                            0x3
#define _EEADRH_EEADR11_SIZE                                0x1
#define _EEADRH_EEADR11_LENGTH                              0x1
#define _EEADRH_EEADR11_MASK                                0x8
#define _EEADRH_EEADR12_POSN                                0x4
#define _EEADRH_EEADR12_POSITION                            0x4
#define _EEADRH_EEADR12_SIZE                                0x1
#define _EEADRH_EEADR12_LENGTH                              0x1
#define _EEADRH_EEADR12_MASK                                0x10
#define _EEADRH_EEADR13_POSN                                0x5
#define _EEADRH_EEADR13_POSITION                            0x5
#define _EEADRH_EEADR13_SIZE                                0x1
#define _EEADRH_EEADR13_LENGTH                              0x1
#define _EEADRH_EEADR13_MASK                                0x20
#define _EEADRH_EEADR14_POSN                                0x6
#define _EEADRH_EEADR14_POSITION                            0x6
#define _EEADRH_EEADR14_SIZE                                0x1
#define _EEADRH_EEADR14_LENGTH                              0x1
#define _EEADRH_EEADR14_MASK                                0x40
#define _EEADRH_EEADRH_POSN                                 0x0
#define _EEADRH_EEADRH_POSITION                             0x0
#define _EEADRH_EEADRH_SIZE                                 0x7
#define _EEADRH_EEADRH_LENGTH                               0x7
#define _EEADRH_EEADRH_MASK                                 0x7F
#define _EEADRH_PMADRH_POSN                                 0x0
#define _EEADRH_PMADRH_POSITION                             0x0
#define _EEADRH_PMADRH_SIZE                                 0x7
#define _EEADRH_PMADRH_LENGTH                               0x7
#define _EEADRH_PMADRH_MASK                                 0x7F
typedef union {
    struct {
        unsigned NVMADRH                :7;
    };
    struct {
        unsigned NVMADR8                :1;
        unsigned NVMADR9                :1;
        unsigned NVMADR10               :1;
        unsigned NVMADR11               :1;
        unsigned NVMADR12               :1;
        unsigned NVMADR13               :1;
        unsigned NVMADR14               :1;
    };
    struct {
        unsigned EEADR8                 :1;
        unsigned EEADR9                 :1;
        unsigned EEADR10                :1;
        unsigned EEADR11                :1;
        unsigned EEADR12                :1;
        unsigned EEADR13                :1;
        unsigned EEADR14                :1;
    };
    struct {
        unsigned EEADRH                 :7;
    };
    struct {
        unsigned PMADRH                 :7;
    };
} PMADRHbits_t;
extern volatile PMADRHbits_t PMADRHbits __at(0x892);
// bitfield macros
#define _PMADRH_NVMADRH_POSN                                0x0
#define _PMADRH_NVMADRH_POSITION                            0x0
#define _PMADRH_NVMADRH_SIZE                                0x7
#define _PMADRH_NVMADRH_LENGTH                              0x7
#define _PMADRH_NVMADRH_MASK                                0x7F
#define _PMADRH_NVMADR8_POSN                                0x0
#define _PMADRH_NVMADR8_POSITION                            0x0
#define _PMADRH_NVMADR8_SIZE                                0x1
#define _PMADRH_NVMADR8_LENGTH                              0x1
#define _PMADRH_NVMADR8_MASK                                0x1
#define _PMADRH_NVMADR9_POSN                                0x1
#define _PMADRH_NVMADR9_POSITION                            0x1
#define _PMADRH_NVMADR9_SIZE                                0x1
#define _PMADRH_NVMADR9_LENGTH                              0x1
#define _PMADRH_NVMADR9_MASK                                0x2
#define _PMADRH_NVMADR10_POSN                               0x2
#define _PMADRH_NVMADR10_POSITION                           0x2
#define _PMADRH_NVMADR10_SIZE                               0x1
#define _PMADRH_NVMADR10_LENGTH                             0x1
#define _PMADRH_NVMADR10_MASK                               0x4
#define _PMADRH_NVMADR11_POSN                               0x3
#define _PMADRH_NVMADR11_POSITION                           0x3
#define _PMADRH_NVMADR11_SIZE                               0x1
#define _PMADRH_NVMADR11_LENGTH                             0x1
#define _PMADRH_NVMADR11_MASK                               0x8
#define _PMADRH_NVMADR12_POSN                               0x4
#define _PMADRH_NVMADR12_POSITION                           0x4
#define _PMADRH_NVMADR12_SIZE                               0x1
#define _PMADRH_NVMADR12_LENGTH                             0x1
#define _PMADRH_NVMADR12_MASK                               0x10
#define _PMADRH_NVMADR13_POSN                               0x5
#define _PMADRH_NVMADR13_POSITION                           0x5
#define _PMADRH_NVMADR13_SIZE                               0x1
#define _PMADRH_NVMADR13_LENGTH                             0x1
#define _PMADRH_NVMADR13_MASK                               0x20
#define _PMADRH_NVMADR14_POSN                               0x6
#define _PMADRH_NVMADR14_POSITION                           0x6
#define _PMADRH_NVMADR14_SIZE                               0x1
#define _PMADRH_NVMADR14_LENGTH                             0x1
#define _PMADRH_NVMADR14_MASK                               0x40
#define _PMADRH_EEADR8_POSN                                 0x0
#define _PMADRH_EEADR8_POSITION                             0x0
#define _PMADRH_EEADR8_SIZE                                 0x1
#define _PMADRH_EEADR8_LENGTH                               0x1
#define _PMADRH_EEADR8_MASK                                 0x1
#define _PMADRH_EEADR9_POSN                                 0x1
#define _PMADRH_EEADR9_POSITION                             0x1
#define _PMADRH_EEADR9_SIZE                                 0x1
#define _PMADRH_EEADR9_LENGTH                               0x1
#define _PMADRH_EEADR9_MASK                                 0x2
#define _PMADRH_EEADR10_POSN                                0x2
#define _PMADRH_EEADR10_POSITION                            0x2
#define _PMADRH_EEADR10_SIZE                                0x1
#define _PMADRH_EEADR10_LENGTH                              0x1
#define _PMADRH_EEADR10_MASK                                0x4
#define _PMADRH_EEADR11_POSN                                0x3
#define _PMADRH_EEADR11_POSITION                            0x3
#define _PMADRH_EEADR11_SIZE                                0x1
#define _PMADRH_EEADR11_LENGTH                              0x1
#define _PMADRH_EEADR11_MASK                                0x8
#define _PMADRH_EEADR12_POSN                                0x4
#define _PMADRH_EEADR12_POSITION                            0x4
#define _PMADRH_EEADR12_SIZE                                0x1
#define _PMADRH_EEADR12_LENGTH                              0x1
#define _PMADRH_EEADR12_MASK                                0x10
#define _PMADRH_EEADR13_POSN                                0x5
#define _PMADRH_EEADR13_POSITION                            0x5
#define _PMADRH_EEADR13_SIZE                                0x1
#define _PMADRH_EEADR13_LENGTH                              0x1
#define _PMADRH_EEADR13_MASK                                0x20
#define _PMADRH_EEADR14_POSN                                0x6
#define _PMADRH_EEADR14_POSITION                            0x6
#define _PMADRH_EEADR14_SIZE                                0x1
#define _PMADRH_EEADR14_LENGTH                              0x1
#define _PMADRH_EEADR14_MASK                                0x40
#define _PMADRH_EEADRH_POSN                                 0x0
#define _PMADRH_EEADRH_POSITION                             0x0
#define _PMADRH_EEADRH_SIZE                                 0x7
#define _PMADRH_EEADRH_LENGTH                               0x7
#define _PMADRH_EEADRH_MASK                                 0x7F
#define _PMADRH_PMADRH_POSN                                 0x0
#define _PMADRH_PMADRH_POSITION                             0x0
#define _PMADRH_PMADRH_SIZE                                 0x7
#define _PMADRH_PMADRH_LENGTH                               0x7
#define _PMADRH_PMADRH_MASK                                 0x7F

// Register: NVMDAT
#define NVMDAT NVMDAT
extern volatile unsigned short          NVMDAT              __at(0x893);
#ifndef _LIB_BUILD
asm("NVMDAT equ 0893h");
#endif
// aliases
extern volatile unsigned short          EEDAT               __at(0x893);
#ifndef _LIB_BUILD
asm("EEDAT equ 0893h");
#endif
extern volatile unsigned short          PMDAT               __at(0x893);
#ifndef _LIB_BUILD
asm("PMDAT equ 0893h");
#endif

// Register: NVMDATL
#define NVMDATL NVMDATL
extern volatile unsigned char           NVMDATL             __at(0x893);
#ifndef _LIB_BUILD
asm("NVMDATL equ 0893h");
#endif
// aliases
extern volatile unsigned char           EEDATL              __at(0x893);
#ifndef _LIB_BUILD
asm("EEDATL equ 0893h");
#endif
extern volatile unsigned char           PMDATL              __at(0x893);
#ifndef _LIB_BUILD
asm("PMDATL equ 0893h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDATL                :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
    struct {
        unsigned EEDAT0                 :1;
        unsigned EEDAT1                 :1;
        unsigned EEDAT2                 :1;
        unsigned EEDAT3                 :1;
        unsigned EEDAT4                 :1;
        unsigned EEDAT5                 :1;
        unsigned EEDAT6                 :1;
        unsigned EEDAT7                 :1;
    };
    struct {
        unsigned EEDATL                 :8;
    };
    struct {
        unsigned PMDATL                 :8;
    };
} NVMDATLbits_t;
